//================================================================================================================================================
// Задача Показать треугольник Паскаля. Сделать вывод в виде равнобедренного треугольника.
/*
Console.WriteLine("Введите порядок степени для треугольника");
int num = Convert.ToInt32(Console.ReadLine());

for (int i = 0; i < num; i++)
{
    for (int j = num; j > i + 1; j--) // или for (int j = 0; j > i; j--) чтоб был не в виде треугольника или for (int j = num; j > i + 1; j--) чтоб начинались слева сразу без пробела
    {
        Console.Write(" ");
    }

    int val = 1;

    for (int j = 0; j <= i; j++)
    {
        Console.Write(val + " ");
        val = (val * (i - j)) / (j + 1);
    }

    Console.WriteLine();
}
*/
//================================================================================================================================================